tap "1password/tap"
tap "facebook/fb"
tap "go-swagger/go-swagger"
tap "homebrew/services"
tap "int128/kubelogin"
tap "minio/stable"
# Library and utilities for processing GIFs
brew "giflib"
# TIFF library and utilities
brew "libtiff"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Cryptographic recipes and primitives for Python
brew "cryptography"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Collection of portable C++ source libraries
brew "boost"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Suite of tools for inspecting disk usage
brew "duc"
# More intuitive version of du in rust
brew "dust"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# C++14 implementation of the TLS-1.3 standard
brew "fizz"
# Modular, composable client/server abstractions framework
brew "wangle"
# Facebook's branch of Apache Thrift, including a new C++ server
brew "fbthrift"
# Thrift functions for querying information from a service
brew "fb303"
# Shared library for Watchman and Eden projects
brew "edencommon"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# AST-based pattern checker for JavaScript
brew "eslint"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line outline and bitmap font editor/converter
brew "fontforge"
# Command-line fuzzy finder written in Go
brew "fzf"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Disk usage analyzer with console interface written in Go
brew "gdu"
# Run gitlab pipelines locally as shell executor or docker executor
brew "gitlab-ci-local"
# Official GitLab CI runner
brew "gitlab-runner"
# Terminal multiplexer
brew "tmux"
# Git status in tmux status bar
brew "gitmux"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Human friendly `go test` runner
brew "gotestsum"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Improved top (interactive process viewer)
brew "htop"
# Install and debug iPhone apps from the command-line
brew "ios-deploy"
# Image manipulation library
brew "jpeg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Build and deploy Go applications on Kubernetes
brew "ko"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Kubernetes controller and tool for one-way encrypted Secrets
brew "kubeseal"
# Simple terminal UI for git commands
brew "lazygit"
# Portable Foreign Function Interface library
brew "libffi"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# Library to render SVG files using Cairo
brew "librsvg"
# Modern and intuitive terminal-based text editor
brew "micro"
# QUIC transport protocol implementation
brew "mvfst"
# Open source relational database management system
brew "mysql@5.7"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage multiple Node.js versions
brew "nvm"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Standalone binary that can run anything
brew "pkgx"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Cross-shell prompt for astronauts
brew "starship"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Image processing library
brew "vips"
# Next generation frontend tooling. It's fast!
brew "vite"
# Watch files and take action when they change
brew "watchman"
# Linter for YAML files
brew "yamllint"
# JavaScript package manager
brew "yarn"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Programming language designed for robustness, optimality, and clarity
brew "zig", link: false
# Programming language designed for robustness, optimality, and clarity
brew "zig@0.14", link: true
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Next-generation plugin manager for zsh
brew "zplug"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# A Powerful Command Line for automating iOS Simulators
brew "facebook/fb/idb-companion"
# Toolkit to work with swagger for golang
brew "go-swagger/go-swagger/go-swagger"
# A kubectl plugin for Kubernetes OpenID Connect authentication
brew "int128/kubelogin/kubelogin"
# High Performance Object Storage compatible with Amazon S3 API
brew "minio/stable/minio"
